Keule/ZAI_GPS/src/hal_esp32/hal_impl.cpp
static void spiRecordTiming(SpiClient client, uint32_t request_us, uint32_t lock_us, uint32_t end_us) {
    const uint32_t dt_us = end_us - request_us;
    SpiPollState& poll = spiPollForClient(client);
    poll.transactions++;
    poll.last_us = dt_us;
    if (dt_us > poll.max_us) {
        poll.max_us = dt_us;
    }

    s_bus_tm.busy_us += dt_us;
    s_bus_tm.transactions++;

    if (s_last_spi_client != SpiClient::NONE && s_last_spi_client != client) {
        s_client_switches++;
        const uint32_t switch_gap_us = s_last_spi_end_us == 0 ? 0 : (lock_us - s_last_spi_end_us);
        if (s_last_spi_client == SpiClient::ADS1118 && client == SpiClient::BNO085) {
            s_was_to_imu_switches++;
            updateLastMax(s_was_to_imu_gap_last_us, s_was_to_imu_gap_max_us, switch_gap_us);
        } else if (s_last_spi_client == SpiClient::BNO085 && client == SpiClient::ADS1118) {
            s_imu_to_was_switches++;
            updateLastMax(s_imu_to_was_gap_last_us, s_imu_to_was_gap_max_us, switch_gap_us);
        } else {
            s_other_switches++;
        }
    }
    s_last_spi_client = client;
    s_last_spi_end_us = end_us;

    if (client == SpiClient::ADS1118 || client == SpiClient::BNO085) {
        if (s_last_sensor_spi_client != SpiClient::NONE && s_last_sensor_spi_client != client) {
            const uint32_t sensor_gap_us = s_last_sensor_spi_end_us == 0 ? 0 : (lock_us - s_last_sensor_spi_end_us);
            if (s_last_sensor_spi_client == SpiClient::ADS1118 && client == SpiClient::BNO085) {
                s_sensor_was_to_imu_switches++;
                updateLastMax(s_sensor_was_to_imu_gap_last_us, s_sensor_was_to_imu_gap_max_us, sensor_gap_us);
            } else if (s_last_sensor_spi_client == SpiClient::BNO085 && client == SpiClient::ADS1118) {
                s_sensor_imu_to_was_switches++;
                updateLastMax(s_sensor_imu_to_was_gap_last_us, s_sensor_imu_to_was_gap_max_us, sensor_gap_us);
            }
        }
        s_last_sensor_spi_client = client;
        s_last_sensor_spi_end_us = end_us;
    }
}

static bool spiTransfer(SpiClient client, const uint8_t* tx, uint8_t* rx, size_t len) {
    const SpiClientConfig& cfg = spiCfg(client);
    if (len == 0) return true;

    const uint32_t request_us = micros();
    spiBeginCritical();
    const uint32_t lock_us = micros();

    digitalWrite(CS_STEER_ANG, HIGH);
    digitalWrite(CS_IMU, HIGH);
    digitalWrite(CS_ACT, HIGH);

    sensorSPI.beginTransaction(SPISettings(cfg.freq_hz, MSBFIRST, cfg.mode));
    digitalWrite(cfg.cs_pin, LOW);
    for (size_t i = 0; i < len; i++) {
        const uint8_t v = sensorSPI.transfer(tx ? tx[i] : 0xFF);
        if (rx) rx[i] = v;
    }
    digitalWrite(cfg.cs_pin, HIGH);
    sensorSPI.endTransaction();

    spiEndCritical();
    const uint32_t end_us = micros();
    spiRecordTiming(client, request_us, lock_us, end_us);
    return true;
}

static void spiCheckDeadline(SpiPollState* poll, uint32_t period_us, uint32_t now_us) {
    if (!poll || period_us == 0) return;
    if (poll->next_due_us == 0) {
        poll->next_due_us = now_us + period_us;
        return;
    }
    if (now_us > poll->next_due_us + period_us) {
        poll->deadline_miss++;
    }
    while (poll->next_due_us <= now_us) {
        poll->next_due_us += period_us;
    }
}

void hal_esp32_imu_spi_check_deadline(uint32_t period_us, uint32_t now_us) {
    spiCheckDeadline(&s_poll_imu, period_us, now_us);
}

bool hal_esp32_imu_raw_transfer(const uint8_t* tx, uint8_t* rx, size_t len) {
    return spiTransfer(SpiClient::BNO085, tx, rx, len);
}

uint32_t hal_esp32_sensor_spi_timing_now_us(void) {
    return micros();
}

void hal_esp32_sensor_spi_lock(void) {
    spiBeginCritical();
}

void hal_esp32_sensor_spi_unlock(void) {
    spiEndCritical();
}

void hal_esp32_sensor_spi_record_imu_transfer(uint32_t request_us, uint32_t lock_us, uint32_t end_us) {
    spiRecordTiming(SpiClient::BNO085, request_us, lock_us, end_us);
}

SPIClass& hal_esp32_sensor_spi_port(void) {
    return sensorSPI;
}

void hal_imu_on_sensor_spi_reinit(void);

// ===================================================================
// Mutex (FreeRTOS recursive mutex) — for NavigationState protection
// ===================================================================
#if configSUPPORT_STATIC_ALLOCATION
static StaticSemaphore_t s_mutex_buffer;
static SemaphoreHandle_t s_mutex = nullptr;
#else
static SemaphoreHandle_t s_mutex = nullptr;
#endif

// ===================================================================
// Serial log mutex — protects USB CDC Serial from concurrent access.
// USB CDC (Serial on ESP32-S3) is NOT thread-safe and will crash
// if two tasks call Serial.printf() simultaneously on different cores.
// ===================================================================
static SemaphoreHandle_t s_log_mutex = nullptr;

// ===================================================================
// GNSS RTCM UART (UM980 corrections, 8N1)
// ===================================================================
static HardwareSerial* s_gnss_rtcm_uart = &Serial1;
static uint8_t s_gnss_rtcm_uart_num = 1;
static SemaphoreHandle_t s_gnss_rtcm_mutex = nullptr;
static bool s_gnss_rtcm_ready = false;
static uint32_t s_gnss_rtcm_drop_bytes = 0;

struct GnssUartPins {
    int8_t rx;
    int8_t tx;
};

static HardwareSerial* gnssUartForNum(uint8_t uart_num) {
    switch (uart_num) {
    case 1: return &Serial1;
    case 2: return &Serial2;
    default: return nullptr;
    }
}

static GnssUartPins gnssUartPinsForNum(uint8_t uart_num) {
    switch (uart_num) {
    case 1: return GnssUartPins{GNSS_UART1_RX, GNSS_UART1_TX};
    case 2: return GnssUartPins{GNSS_UART2_RX, GNSS_UART2_TX};
    default: return GnssUartPins{-1, -1};
    }
}

void hal_esp32_gnss_rtcm_set_uart(uint8_t uart_num) {
    HardwareSerial* uart = gnssUartForNum(uart_num);
    if (!uart) {
        LOGW("HAL", "GNSS RTCM UART%u unsupported (valid: 1 or 2), keeping UART%u",
             static_cast<unsigned>(uart_num),
             static_cast<unsigned>(s_gnss_rtcm_uart_num));
        return;
    }
    if (s_gnss_rtcm_ready) {
        LOGW("HAL", "GNSS RTCM UART already active on UART%u, switch ignored",
             static_cast<unsigned>(s_gnss_rtcm_uart_num));
        return;
    }
    s_gnss_rtcm_uart_num = uart_num;
    s_gnss_rtcm_uart = uart;
    LOGI("HAL", "GNSS RTCM mapped to UART%u", static_cast<unsigned>(s_gnss_rtcm_uart_num));
}

