Keule/ZAI_GPS/src/hal_esp32/hal_impl.cpp
bool hal_gnss_rtcm_begin(uint32_t baud, int8_t rx_pin, int8_t tx_pin) {
    if (!s_gnss_rtcm_uart) {
        LOGE("HAL", "GNSS RTCM begin failed: UART mapping is null");
        return false;
    }
    if (baud == 0) {
        LOGE("HAL", "GNSS RTCM begin failed: baud must be > 0");
        return false;
    }
    if (!s_gnss_rtcm_mutex) {
        s_gnss_rtcm_mutex = xSemaphoreCreateMutex();
    }
    if (s_gnss_rtcm_mutex) {
        xSemaphoreTake(s_gnss_rtcm_mutex, portMAX_DELAY);
    }

    const GnssUartPins defaults = gnssUartPinsForNum(s_gnss_rtcm_uart_num);
    const int uart_rx = (rx_pin < 0) ? static_cast<int>(defaults.rx) : static_cast<int>(rx_pin);
    const int uart_tx = (tx_pin < 0) ? static_cast<int>(defaults.tx) : static_cast<int>(tx_pin);

    if (uart_tx < 0) {
        LOGE("HAL", "GNSS RTCM begin failed: UART%u TX pin unresolved",
             static_cast<unsigned>(s_gnss_rtcm_uart_num));
        if (s_gnss_rtcm_mutex) {
            xSemaphoreGive(s_gnss_rtcm_mutex);
        }
        return false;
    }
    if (uart_rx >= 38 && uart_rx <= 42) {
        LOGE("HAL", "GNSS RTCM begin failed: RX pin %d is output-only on ESP32-S3", uart_rx);
        if (s_gnss_rtcm_mutex) {
            xSemaphoreGive(s_gnss_rtcm_mutex);
        }
        return false;
    }

    s_gnss_rtcm_uart->begin(baud, SERIAL_8N1, uart_rx, uart_tx);
    s_gnss_rtcm_ready = true;
    if (s_gnss_rtcm_mutex) {
        xSemaphoreGive(s_gnss_rtcm_mutex);
    }

    LOGI("HAL", "GNSS RTCM UART%u ready (baud=%lu, mode=8N1, rx=%d, tx=%d)",
         static_cast<unsigned>(s_gnss_rtcm_uart_num),
         static_cast<unsigned long>(baud),
         uart_rx,
         uart_tx);
    return true;
}

size_t hal_gnss_rtcm_write(const uint8_t* data, size_t len) {
    if (!data || len == 0) return 0;
    if (!s_gnss_rtcm_mutex) {
        s_gnss_rtcm_mutex = xSemaphoreCreateMutex();
    }
    if (s_gnss_rtcm_mutex) {
        xSemaphoreTake(s_gnss_rtcm_mutex, portMAX_DELAY);
    }
    if (!s_gnss_rtcm_ready || !s_gnss_rtcm_uart) {
        LOGW("HAL", "GNSS RTCM write dropped (%u bytes): UART not initialised",
             static_cast<unsigned>(len));
        s_gnss_rtcm_drop_bytes += static_cast<uint32_t>(len);
        if (s_gnss_rtcm_mutex) {
            xSemaphoreGive(s_gnss_rtcm_mutex);
        }
        return 0;
    }

    const size_t written = s_gnss_rtcm_uart->write(data, len);
    if (s_gnss_rtcm_mutex) {
        xSemaphoreGive(s_gnss_rtcm_mutex);
    }

    if (written < len) {
        const size_t dropped = len - written;
        s_gnss_rtcm_drop_bytes += static_cast<uint32_t>(dropped);
        LOGW("HAL", "GNSS RTCM short write: %u/%u bytes", static_cast<unsigned>(written), static_cast<unsigned>(len));
    }

    return written;
}

bool hal_gnss_rtcm_is_ready(void) {
    return s_gnss_rtcm_ready;
}

uint32_t hal_gnss_rtcm_drop_count(void) {
    if (!s_gnss_rtcm_mutex) {
        return s_gnss_rtcm_drop_bytes;
    }
    xSemaphoreTake(s_gnss_rtcm_mutex, portMAX_DELAY);
    const uint32_t dropped = s_gnss_rtcm_drop_bytes;
    xSemaphoreGive(s_gnss_rtcm_mutex);
    return dropped;
}

// ===================================================================
// Timing
// ===================================================================
uint32_t hal_millis(void) {
    return ::millis();
}

uint32_t hal_micros(void) {
    return ::micros();
}

void hal_delay_ms(uint32_t ms) {
    ::delay(ms);
}

// ===================================================================
// Logging – prints to USB CDC Serial via Serial.printf.
//
// ESP_LOGI goes to UART0 by default, which does NOT appear on
// USB CDC Serial on ESP32-S3.  Serial.printf goes to USB CDC.
//
// hal_log() is kept for ABI compatibility with logic/ modules.
// New code should use LOGI/LOGD/LOGW/LOGE from log_ext.h directly.
// ===================================================================
void hal_log(const char* fmt, ...) {
    char buf[256];
    va_list args;
    va_start(args, fmt);
    std::vsnprintf(buf, sizeof(buf), fmt, args);
    va_end(args);

    char category[20] = "LOG";
    char detail[20] = "";
    const char* body = buf;
    const char* colon = std::strchr(buf, ':');
    if (colon && colon != buf && (colon - buf) < 28) {
        bool tag_ok = true;
        for (const char* p = buf; p < colon; ++p) {
            const char c = *p;
            const bool alpha = (c >= 'A' && c <= 'Z') || (c >= 'a' && c <= 'z');
            const bool digit = (c >= '0' && c <= '9');
            if (!alpha && !digit && c != '_' && c != '-') {
                tag_ok = false;
                break;
            }
        }

        if (tag_ok) {
            const char* dash = nullptr;
            for (const char* p = buf; p < colon; ++p) {
                if (*p == '-') {
                    dash = p;
                    break;
                }
            }

            const char* category_end = dash ? dash : colon;
            size_t category_len = static_cast<size_t>(category_end - buf);
            if (category_len >= sizeof(category)) category_len = sizeof(category) - 1;
            for (size_t i = 0; i < category_len; ++i) {
                const char c = buf[i];
                category[i] = (c >= 'a' && c <= 'z') ? static_cast<char>(c - 'a' + 'A') : c;
            }
            category[category_len] = '\0';

            if (dash && dash + 1 < colon) {
                size_t detail_len = static_cast<size_t>(colon - dash - 1);
                if (detail_len >= sizeof(detail)) detail_len = sizeof(detail) - 1;
                for (size_t i = 0; i < detail_len; ++i) {
                    const char c = dash[1 + i];
                    detail[i] = (c >= 'a' && c <= 'z') ? static_cast<char>(c - 'a' + 'A') : c;
                }
                detail[detail_len] = '\0';
            }

            body = colon + 1;
            while (*body == ' ') {
                body++;
            }
        }
    }

    // Protect Serial (USB CDC) from concurrent access across cores.
    if (s_log_mutex) {
        xSemaphoreTake(s_log_mutex, portMAX_DELAY);
    }
    if (detail[0] != '\0') {
        Serial.printf("[%s] [%10lu] %s: %s\n", category, millis(), detail, body);
    } else {
        Serial.printf("[%s] [%10lu] %s\n", category, millis(), body);
    }
    if (s_log_mutex) {
        xSemaphoreGive(s_log_mutex);
    }
}

// ===================================================================
// Mutex
// ===================================================================
void hal_mutex_init(void) {
    // State mutex (recursive, for NavigationState)
#if configSUPPORT_STATIC_ALLOCATION
    s_mutex = xSemaphoreCreateRecursiveMutexStatic(&s_mutex_buffer);
#else
    s_mutex = xSemaphoreCreateRecursiveMutex();
#endif

    // Serial log mutex (binary, protects USB CDC from concurrent access)
    s_log_mutex = xSemaphoreCreateMutex();
}

void hal_mutex_lock(void) {
    if (s_mutex) {
        xSemaphoreTakeRecursive(s_mutex, portMAX_DELAY);
    }
}

void hal_mutex_unlock(void) {
    if (s_mutex) {
        xSemaphoreGiveRecursive(s_mutex);
    }
}

// ===================================================================
// Safety input
// ===================================================================
bool hal_safety_ok(void) {
    // SAFETY_IN is active LOW: LOW = KICK, HIGH = OK
    return digitalRead(SAFETY_IN) == HIGH;
}

// ===================================================================
// SPI Sensors / Actuator - SPI Bus 2 (FSPI / SPI2_HOST)
// ===================================================================
void hal_sensor_spi_init(void) {
    sensorSPI.begin(SENS_SPI_SCK, SENS_SPI_MISO, SENS_SPI_MOSI, -1);
    if (!s_spi_bus_mutex) {
        s_spi_bus_mutex = xSemaphoreCreateMutex();
    }
    s_bus_tm.window_start_us = micros();
    s_bus_tm.busy_us = 0;
    s_bus_tm.transactions = 0;
    s_poll_imu = {};
    s_poll_was = {};
    s_poll_act = {};
    s_last_spi_client = SpiClient::NONE;
    s_last_spi_end_us = 0;
    s_last_sensor_spi_client = SpiClient::NONE;
    s_last_sensor_spi_end_us = 0;
    s_client_switches = 0;
    s_was_to_imu_switches = 0;
    s_imu_to_was_switches = 0;
    s_other_switches = 0;
    s_was_to_imu_gap_last_us = 0;
    s_was_to_imu_gap_max_us = 0;
    s_imu_to_was_gap_last_us = 0;
    s_imu_to_was_gap_max_us = 0;
    s_sensor_was_to_imu_switches = 0;
    s_sensor_imu_to_was_switches = 0;
    s_sensor_was_to_imu_gap_last_us = 0;
    s_sensor_was_to_imu_gap_max_us = 0;
    s_sensor_imu_to_was_gap_last_us = 0;
    s_sensor_imu_to_was_gap_max_us = 0;
    s_was_cache_valid = false;
    hal_log("ESP32: sensor SPI initialised on FSPI/SPI2_HOST (SCK=%d MISO=%d MOSI=%d)",
            SENS_SPI_SCK, SENS_SPI_MISO, SENS_SPI_MOSI);
}

