Keule/ZAI_GPS/src/hal_esp32/hal_impl.cpp
void hal_sensor_spi_deinit(void) {
    spiBeginCritical();
    sensorSPI.end();
    spiEndCritical();
    hal_log("ESP32: shared SPI released (FSPI peripheral free)");
}

void hal_sensor_spi_reinit(void) {
    // Ensure the bus is fully released before re-initialising.
    // The OTA code creates a LOCAL SPIClass(FSPI) which can leave
    // the FSPI peripheral in an inconsistent state.  Calling end()
    // again on our sensorSPI forces a clean release, then we re-init
    // with a settling delay.
    spiBeginCritical();
    sensorSPI.end();
    delay(50);   // let SPI peripheral fully settle
    sensorSPI.begin(SENS_SPI_SCK, SENS_SPI_MISO, SENS_SPI_MOSI, -1);
    s_bus_tm.window_start_us = micros();
    s_bus_tm.busy_us = 0;
    s_bus_tm.transactions = 0;
    s_poll_imu = {};
    s_poll_was = {};
    s_poll_act = {};
    s_last_spi_client = SpiClient::NONE;
    s_last_spi_end_us = 0;
    s_last_sensor_spi_client = SpiClient::NONE;
    s_last_sensor_spi_end_us = 0;
    s_client_switches = 0;
    s_was_to_imu_switches = 0;
    s_imu_to_was_switches = 0;
    s_other_switches = 0;
    s_was_to_imu_gap_last_us = 0;
    s_was_to_imu_gap_max_us = 0;
    s_imu_to_was_gap_last_us = 0;
    s_imu_to_was_gap_max_us = 0;
    s_sensor_was_to_imu_switches = 0;
    s_sensor_imu_to_was_switches = 0;
    s_sensor_was_to_imu_gap_last_us = 0;
    s_sensor_was_to_imu_gap_max_us = 0;
    s_sensor_imu_to_was_gap_last_us = 0;
    s_sensor_imu_to_was_gap_max_us = 0;
    s_was_cache_valid = false;
    spiEndCritical();
    delay(10);   // let GPIO matrix reconfigure
    hal_log("ESP32: shared SPI re-initialised on FSPI/SPI2_HOST (SCK=%d MISO=%d MOSI=%d)",
            SENS_SPI_SCK, SENS_SPI_MISO, SENS_SPI_MOSI);
    hal_imu_on_sensor_spi_reinit();
}

void hal_sensor_spi_get_telemetry(HalSpiTelemetry* out) {
    if (!out) return;
    std::memset(out, 0, sizeof(*out));
    const uint32_t now_us = micros();
    const uint32_t win_us = (s_bus_tm.window_start_us == 0 || now_us <= s_bus_tm.window_start_us)
                                ? 0
                                : (now_us - s_bus_tm.window_start_us);
    out->window_ms = win_us / 1000;
    out->bus_busy_us = s_bus_tm.busy_us;
    out->bus_transactions = s_bus_tm.transactions;
    out->imu_transactions = s_poll_imu.transactions;
    out->was_transactions = s_poll_was.transactions;
    out->actuator_transactions = s_poll_act.transactions;
    out->imu_last_us = s_poll_imu.last_us;
    out->imu_max_us = s_poll_imu.max_us;
    out->was_last_us = s_poll_was.last_us;
    out->was_max_us = s_poll_was.max_us;
    out->actuator_last_us = s_poll_act.last_us;
    out->actuator_max_us = s_poll_act.max_us;
    out->client_switches = s_client_switches;
    out->was_to_imu_switches = s_was_to_imu_switches;
    out->imu_to_was_switches = s_imu_to_was_switches;
    out->other_switches = s_other_switches;
    out->was_to_imu_gap_last_us = s_was_to_imu_gap_last_us;
    out->was_to_imu_gap_max_us = s_was_to_imu_gap_max_us;
    out->imu_to_was_gap_last_us = s_imu_to_was_gap_last_us;
    out->imu_to_was_gap_max_us = s_imu_to_was_gap_max_us;
    out->sensor_was_to_imu_switches = s_sensor_was_to_imu_switches;
    out->sensor_imu_to_was_switches = s_sensor_imu_to_was_switches;
    out->sensor_was_to_imu_gap_last_us = s_sensor_was_to_imu_gap_last_us;
    out->sensor_was_to_imu_gap_max_us = s_sensor_was_to_imu_gap_max_us;
    out->sensor_imu_to_was_gap_last_us = s_sensor_imu_to_was_gap_last_us;
    out->sensor_imu_to_was_gap_max_us = s_sensor_imu_to_was_gap_max_us;
    out->imu_deadline_miss = s_poll_imu.deadline_miss;
    out->was_deadline_miss = s_poll_was.deadline_miss;
    if (win_us > 0) {
        out->bus_utilization_pct = (100.0f * static_cast<float>(s_bus_tm.busy_us)) / static_cast<float>(win_us);
    }
}

void hal_imu_get_spi_info(HalImuSpiInfo* out) {
    if (!out) return;
    out->sck_pin = SENS_SPI_SCK;
    out->miso_pin = SENS_SPI_MISO;
    out->mosi_pin = SENS_SPI_MOSI;
    out->cs_pin = CS_IMU;
    out->int_pin = IMU_INT;
    out->freq_hz = k_spi_cfg_imu.freq_hz;
    out->mode = k_spi_cfg_imu.mode;
}

void hal_imu_set_spi_config(uint32_t freq_hz, uint8_t mode) {
    if (freq_hz == 0) return;
    k_spi_cfg_imu.freq_hz = freq_hz;
    k_spi_cfg_imu.mode = mode;
    hal_log("ESP32: IMU SPI config set (freq=%luHz mode=%u)",
            (unsigned long)k_spi_cfg_imu.freq_hz,
            (unsigned)k_spi_cfg_imu.mode);
}

// ===================================================================
// ADS1118 - 16-Bit ADC for steering angle potentiometer
// ===================================================================
// Uses libdriver/ads1118 (lib/ads1118/src/) for initialisation only.
// For runtime reads, we bypass the libdriver and read raw ADC data
// directly via SPI to avoid the "range is invalid" bug in the
// libdriver's continuous_read() (which reads back the config register
// and fails if SPI returns garbage).
//
// The libdriver is used only for:
//   - ads1118_init() — verify interface functions
//   - ads1118_set_channel/range/rate/mode — configure the chip
//   - ads1118_start_continuous_read() — start continuous conversion
//
// All subsequent reads use ads1118_read_raw() which sends 0xFF×2
// and reads back 2 bytes as a raw int16_t ADC value. No config
// register read-back, no range validation.
//
// Wiring:
//   ADS1118 DOUT  -> GPIO 15 (MISO)
//   ADS1118 DIN   -> GPIO 17 (MOSI)
//   ADS1118 SCLK  -> GPIO 16 (SCK)
//   ADS1118 CS    -> GPIO 18
//
// Calibration:
//   Raw ADC min (left stop)  -> -22.5°
//   Raw ADC max (right stop) -> +22.5°
//   Stored in NVS (Preferences) and survives reboots.
// ===================================================================

/// libdriver ADS1118 handle (used for init/config only)
static ads1118_handle_t s_ads1118_handle;

/// ADS1118 detected flag
static bool s_ads1118_detected = false;

/// Calibration state
static bool   s_calibrated = false;
static int16_t s_cal_left_raw  = 0;   // ADC value at left stop  -> -22.5°
static int16_t s_cal_right_raw = 0;   // ADC value at right stop -> +22.5°

/// NVS namespace and keys for calibration persistence
static const char* NVS_NAMESPACE = "agsteer";
static const char* NVS_KEY_CAL_VALID  = "cal_v";
static const char* NVS_KEY_CAL_LEFT   = "cal_l";
static const char* NVS_KEY_CAL_RIGHT  = "cal_r";
static constexpr uint32_t NVS_CAL_MAGIC = 0xA6511C00;  // magic to validate stored data

// --- libdriver interface functions (static, ESP32-specific) ---

static uint8_t ads1118_if_spi_init(void) {
    pinMode(CS_STEER_ANG, OUTPUT);
    digitalWrite(CS_STEER_ANG, HIGH);
    return 0;
}

static uint8_t ads1118_if_spi_deinit(void) {
    return 0;  // Don't deinit shared bus
}

static uint8_t ads1118_if_spi_transmit(uint8_t *tx, uint8_t *rx, uint16_t len) {
    spiTransfer(SpiClient::ADS1118, tx, rx, len);
    return 0;
}

static void ads1118_if_delay_ms(uint32_t ms) {
    delay(ms);
}

static void ads1118_if_debug_print(const char *const fmt, ...) {
    va_list args;
    va_start(args, fmt);
    char buf[256];
    std::vsnprintf(buf, sizeof(buf), fmt, args);
    va_end(args);
    Serial.print(buf);
}

// --- Direct raw ADC read (bypasses libdriver) ---

/// Read one raw 16-bit ADC sample directly via SPI.
/// Sends 0xFF×2, receives 2 bytes as big-endian int16_t.
/// This avoids the libdriver's config register read-back which can
/// trigger "range is invalid" if SPI returns garbage.
static int16_t ads1118_read_raw(void) {
    const uint32_t now_us = micros();
    if (s_was_cache_valid && (now_us - s_was_last_poll_us) < k_spi_cfg_ads.period_us) {
        return s_was_raw_cache;
    }
    spiCheckDeadline(&s_poll_was, k_spi_cfg_ads.period_us, now_us);
    uint8_t tx[2] = {0xFF, 0xFF};
    uint8_t rx[2] = {0};
    ads1118_if_spi_transmit(tx, rx, 2);
    s_was_raw_cache = static_cast<int16_t>((static_cast<uint16_t>(rx[0]) << 8) | rx[1]);
    s_was_last_poll_us = now_us;
    s_was_cache_valid = true;
    return s_was_raw_cache;
}

