Keule/ZAI_GPS/src/hal_esp32/hal_impl.cpp
        // Start dedicated RTCM UDP listener (raw bytestream, no AOG framing).
        ethUDP_rtcm.begin(aog_port::RTCM_LISTEN);
        hal_log("ETH: UDP listening on RTCM port %u (AgIO/NTRIP correction input)",
                aog_port::RTCM_LISTEN);

        // Start send UDP socket from port 5126 (our source port)
        // Reference: portMy = 5126
        ethUDP_send.begin(aog_port::STEER);
        hal_log("ETH: UDP sending from port %u (to AgIO port %u)", aog_port::STEER, aog_port::AGIO_SEND);
        break;

    case ARDUINO_EVENT_ETH_DISCONNECTED:
        hal_log("ETH: link DOWN");
        s_eth_link_up = false;
        s_eth_has_ip = false;
        ethUDP_recv.stop();
        ethUDP_send.stop();
        ethUDP_rtcm.stop();
        break;

    case ARDUINO_EVENT_ETH_STOP:
        hal_log("ETH: driver stopped");
        s_eth_link_up = false;
        s_eth_has_ip = false;
        ethUDP_recv.stop();
        ethUDP_send.stop();
        ethUDP_rtcm.stop();
        break;

    default:
        break;
    }
}

void hal_net_init(void) {
    // Register Ethernet event handler
    WiFi.onEvent(onEthEvent);

    bool init_ok = false;

#if CONFIG_IDF_TARGET_ESP32
    // ESP32 target: follow LilyGO pattern and prefer the macro-driven ETH.begin()
    // variant (RMII/W5500 depending on board-level ETH_* defines).
    #if defined(LILYGO_T_ETH_LITE_ESP32)
        hal_log("ETH: initialising ESP32 ETH via macro profile (PHY=%d ADDR=%d MDC=%d MDIO=%d PWR=%d CLK_MODE=%d)",
                ETH_TYPE, ETH_ADDR, ETH_MDC_PIN, ETH_MDIO_PIN, ETH_POWER_PIN, ETH_CLK_MODE);
        init_ok = ETH.begin((eth_phy_type_t)ETH_TYPE, ETH_ADDR, ETH_MDC_PIN, ETH_MDIO_PIN, ETH_POWER_PIN, ETH_CLK_MODE);
    #else
        // Fallback for ESP32 boards wired with W5500 via SPI (same call signature as S3).
        hal_log("ETH: initialising ESP32 W5500 via SPI fallback (SCK=%d MISO=%d MOSI=%d CS=%d INT=%d RST=%d)",
                ETH_SCK, ETH_MISO, ETH_MOSI, ETH_CS, ETH_INT, ETH_RST);
        init_ok = ETH.begin(
            ETH_PHY_W5500,
            1,
            ETH_CS,
            ETH_INT,
            ETH_RST,
            SPI3_HOST,
            ETH_SCK,
            ETH_MISO,
            ETH_MOSI
        );
    #endif
#else
    // ESP32-S3 target: onboard W5500 over SPI3_HOST.
    hal_log("ETH: initialising W5500 on SPI3_HOST (SCK=%d MISO=%d MOSI=%d CS=%d INT=%d RST=%d)...",
            ETH_SCK, ETH_MISO, ETH_MOSI, ETH_CS, ETH_INT, ETH_RST);

    init_ok = ETH.begin(
        ETH_PHY_W5500,
        1,
        ETH_CS,
        ETH_INT,
        ETH_RST,
        SPI3_HOST,
        ETH_SCK,
        ETH_MISO,
        ETH_MOSI
    );
#endif

    if (!init_ok) {
        hal_log("ETH: FAILED - Check Configuration.");
        s_w5500_detected = false;
        return;
    }

    s_w5500_detected = true;
    hal_log("ETH: chip detected OK");

    // Configure static IP address
    if (!ETH.config(s_local_ip, s_gateway, s_subnet, s_dns, s_dns)) {
        hal_log("ETH: static IP config failed (may be using DHCP)");
    }

    // Wait up to 5 seconds for link-up and IP assignment
    uint32_t wait_start = millis();
    while (!s_eth_has_ip && (millis() - wait_start < 5000)) {
        delay(100);
        // Feed the event loop so ETH events can be processed
        yield();
    }

    if (s_eth_has_ip) {
        hal_log("ETH: ready - IP=%s", ETH.localIP().toString().c_str());
    } else if (s_eth_link_up) {
        hal_log("ETH: link up but no IP yet (waiting for DHCP...)");
    } else {
        hal_log("ETH: WARNING - no link detected (cable unplugged?)");
    }
}

void hal_net_send(const uint8_t* data, size_t len, uint16_t port) {
    if (!s_eth_has_ip) return;

    // Always send TO AgIO port 9999 (port parameter is legacy, ignored)
    // Reference: portDestination = 9999
    ethUDP_send.beginPacket(s_dest_ip, aog_port::AGIO_SEND);
    ethUDP_send.write(data, static_cast<size_t>(len));
    ethUDP_send.endPacket();
}

void hal_net_set_dest_ip(uint8_t ip0, uint8_t ip1, uint8_t ip2, uint8_t ip3) {
    s_dest_ip = IPAddress(ip0, ip1, ip2, ip3);
    hal_log("HAL: dest IP updated to %u.%u.%u.%u", ip0, ip1, ip2, ip3);
}

int hal_net_receive(uint8_t* buf, size_t max_len, uint16_t* out_port) {
    if (!s_eth_has_ip) return 0;

    int packet_size = ethUDP_recv.parsePacket();
    if (packet_size <= 0) return 0;

    if (static_cast<size_t>(packet_size) > max_len) {
        packet_size = static_cast<int>(max_len);
    }

    int read = ethUDP_recv.read(buf, packet_size);
    if (out_port) {
        *out_port = static_cast<uint16_t>(ethUDP_recv.remotePort());
    }
    return read;
}

int hal_net_receive_rtcm(uint8_t* buf, size_t max_len, uint16_t* out_port) {
    if (!s_eth_has_ip) return 0;

    int packet_size = ethUDP_rtcm.parsePacket();
    if (packet_size <= 0) return 0;

    if (static_cast<size_t>(packet_size) > max_len) {
        packet_size = static_cast<int>(max_len);
    }

    int read = ethUDP_rtcm.read(buf, packet_size);
    if (out_port) {
        *out_port = static_cast<uint16_t>(ethUDP_rtcm.remotePort());
    }
    return read;
}

bool hal_net_is_connected(void) {
    return s_eth_has_ip;
}

bool hal_net_detected(void) {
    return s_w5500_detected;
}

// ===================================================================
// ESP32 init all
// ===================================================================
static void hal_esp32_common_boot_init(void) {
    // Serial
    Serial.begin(115200);
    uint32_t serial_start = millis();
    while (!Serial && (millis() - serial_start < 3000)) {
        delay(10);
    }

    // Redirect ESP-IDF log (ESP_LOGI etc.) to USB CDC Serial.
    // Without this, esp_log goes to UART0 while Serial.println
    // goes to USB CDC — user would only see half the output.
    Serial.setDebugOutput(true);

    hal_log("ESP32 AgSteer starting...");

    // Mutex
    hal_mutex_init();

    hal_log("ESP32 seting safety pin input...");

    // Safety pin
    pinMode(SAFETY_IN, INPUT_PULLUP);
    hal_log("ESP32 start spi"); 
    // SPI sensor bus (FSPI / SPI2_HOST) - SCK=16, MISO=15, MOSI=17
    //hal_sensor_spi_init();
    hal_log("ESP32 init done"); 
}

void hal_esp32_init_imu_bringup(void) {
    hal_esp32_common_boot_init();

    // IMU + steering-angle ADC for SPI cross-device diagnostics.
    // Keep actuator/network disabled in bring-up mode.
    hal_imu_begin();
    hal_imu_reset_pulse(10, 20);
    hal_steer_angle_begin();
    hal_log("ESP32: IMU bring-up HAL init complete (ADS enabled, actuator/network skipped)");
}

void hal_esp32_init_gnss_buildup(void) {
    hal_esp32_common_boot_init();

#if defined(GNSS_BUILDUP_RTCM_UART_NUM)
    constexpr uint8_t k_rtcm_uart_num = GNSS_BUILDUP_RTCM_UART_NUM;
#else
    constexpr uint8_t k_rtcm_uart_num = 1;
#endif

#if defined(GNSS_BUILDUP_RTCM_BAUD)
    constexpr uint32_t k_rtcm_baud = GNSS_BUILDUP_RTCM_BAUD;
#else
    constexpr uint32_t k_rtcm_baud = 115200;
#endif

#if defined(GNSS_BUILDUP_RTCM_RX_PIN)
    constexpr int8_t k_rtcm_rx_pin = static_cast<int8_t>(GNSS_BUILDUP_RTCM_RX_PIN);
#else
    constexpr int8_t k_rtcm_rx_pin = GNSS_UART1_RX;
#endif

#if defined(GNSS_BUILDUP_RTCM_TX_PIN)
    constexpr int8_t k_rtcm_tx_pin = static_cast<int8_t>(GNSS_BUILDUP_RTCM_TX_PIN);
#else
    constexpr int8_t k_rtcm_tx_pin = GNSS_UART1_TX;
#endif

    // Communication path required for RTCM ingress (ETH UDP).
    hal_net_init();

    // Dedicated RTCM egress over GNSS UART.
    hal_esp32_gnss_rtcm_set_uart(k_rtcm_uart_num);
    const bool gnss_uart_ok = hal_gnss_rtcm_begin(k_rtcm_baud, k_rtcm_rx_pin, k_rtcm_tx_pin);
    hal_log("ESP32: GNSS buildup HAL init %s (ETH=%s, UART%u baud=%lu rx=%d tx=%d)",
            gnss_uart_ok ? "complete" : "degraded",
            hal_net_is_connected() ? "UP" : "DOWN",
            static_cast<unsigned>(k_rtcm_uart_num),
            static_cast<unsigned long>(k_rtcm_baud),
            static_cast<int>(k_rtcm_rx_pin),
            static_cast<int>(k_rtcm_tx_pin));
}

void hal_esp32_init_all(void) {
    hal_esp32_common_boot_init();

    // IMU, steer angle, actuator
    hal_imu_begin();
    hal_steer_angle_begin();
    hal_actuator_begin();

    // Network (W5500 via ETH driver)
    hal_net_init();

    hal_log("ESP32: all subsystems initialised (%s)",
            s_eth_has_ip ? "ETH UP" :
            s_w5500_detected ? "ETH no link" :
            "W5500 not found");
}
